

&НаКлиенте
Процедура Команда1(Команда)
	#Если МобильныйКлиент Тогда
    Попытка
        ВнешнееПриложение = новый ЗапускПриложенияМобильногоУстройства;

        ВнешнееПриложение.Действие = "com.google.zxing.client.android.SCAN";
        ВнешнееПриложение.Приложение = "com.google.zxing.client.android";
        ВнешнееПриложение.ДополнительныеДанные.Добавить("PROMPT_MESSAGE", "Scan Code");

        Результат = ВнешнееПриложение.Запустить(Истина);
        	Если Результат = -1 и не ВнешнееПриложение.ДополнительныеДанные.Получить("SCAN_RESULT") = неопределено Тогда
            	РезСкан = ВнешнееПриложение.ДополнительныеДанные.Получить("SCAN_RESULT");
     			нс = Объект.КоллекцияВведенныхШК.Добавить();
				нс.ЗначениеШК = РезСкан.Значение;
			КонецЕсли;       
    	Исключение
        	Сообщить(ОписаниеОшибки());
    	КонецПопытки
	#КонецЕсли
КонецПроцедуры


&НаКлиенте
Процедура СканироватьШК(Команда)
	#Если не МобильныйКлиент Тогда
		СОобщить("Для Мобильного клиента!!!");
		возврат;
	#КонецЕсли
	Если СредстваМультимедиа.ПоддерживаетсяСканированиеШтрихКодов() Тогда
		ПослеСкан = новый ОписаниеОповещения("ПослеСканированияШК", ЭтаФорма); 
		СредстваМультимедиа.ПоказатьСканированиеШтрихКодов("Отсканируйте штрихкод",ПослеСкан,,ТипШтрихкода.Линейный);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеСканированияШК(ШтрихКод, Результат, Сообщение) Экспорт
	Если Результат Тогда
		Сообщить(ШтрихКод);
		нс= Объект.КоллекцияВведенныхШК.Добавить();
		нс.ЗначениеШК = ШтрихКод;
	КонецЕсли;
КонецПроцедуры